Public Attributes | List of all members
API_IFCPropertyEnumeratedValue Struct Reference
Element Manager
IFC property with a list of possible and selected value. More...
#include <APIdefs_Properties.h>
 Public Attributes
 GS::Array< API_IFCPropertyValue >  | enumerationReference
List of possible values of the property.
 GS::Array< API_IFCPropertyValue >  | enumerationValues
List of selected values of the property.
Detailed Description
IFC property with a list of possible and selected value.
Remarks
This structure contains the list of possible and selected values of an IfcPropertyEnumeratedValue. All values shall have the same type. The enumerationReference shall contain all the values of enumerationValues, which shall contain at least one value.